Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/housing_grants_and_schemes/improvement_works_in_lieu_of_local_authority_housing.html.txt.tmx
Source language: en
Languages: ga

source: Improvement works in lieu of local authority housing
ga: Obair fheabhsucháin in áit tí ón údarás áitiúil

source: This scheme enables local authorities to improve or extend privately owned houses as an alternative to providing local authority housing
ga: Tríd an scéim seo is féidir le húdaráis áitiúla tithe príobháideacha a fheabhsú nó a mhéadú in áit tithe a chur ar fáil

source: Carrying out the work must satisfy your housing need and result in your removal from the housing waiting list
ga: Caithfidh an obair comhlíonta do riachtanas tithíochta a shásamh agus beidh do bhaint den liosta feithimh leis an údarás áitiúil de thoradh ar an obair seo

source: It is aimed at:
ga: Tá sé ar fáil do:

source: • Owner-occupiers whose homes are overcrowded or sub-standard and who cannot afford to carry out improvements and
ga: • Dhaoine atá ina gcónaí ina dtithe féin ach go bhfuil an iomarca daoine sa teach amháin, nó go bhfuil caighdeán an tí faoi bhunleibhéal agus nach bhfuil sé d'acmhainn acu na feabhsucháin chuí a dhéanamh iad féin agus

source: • Local authority tenants, people on the housing list, tenant purchasers or housing association tenants who want to move into a home owned by a relative but cannot because the home is sub-standard or too small
ga: • Thionóntaí an údaráis áitiúil, daoine atá ar an liosta tithíochta, tionóntaí atá ag ceannach a dtithe ón údarás áitiúil nó tionóntaí chumainn tithíochta gur mian leo aistriú isteach i dteach le gaol leo ach nach sásaíonn an teach sin na bunchaighdeáin nó go bhfuil an teach ró-bheag

source: If you qualify, the local authority will carry out works to adapt the house or to provide extra bedrooms
ga: Má tá tú ina theideal, déanfaidh an t-údarás áitiúil an obair leis an teach a oitiúnú nó le seomraí codalta breise a chur ar fáil

source: The local authority will pay the full cost of the works carried out and you will then pay a charge to the local authority for a maximum of 15 years
ga: Íocfaidh an t-údarás áitiúil costas iomlán na hoibre agus beidh táille le n-íoc agat leis an údarás ar feadh tréimhse nach faide ná 15 bliain

source: If during the 15-year period, you have paid an amount equal to the total cost of the works, the charge will stop
ga: Má íocann tú costas iomlán na hoibre leis an údarás i dtréimhse níos giorra ná 15 bliain, cuirfear deireadh leis an táille

source: The charge will be worked out in a similar way to the differential rent scheme for local authority rents, so it is based on your ability to pay
ga: Beidh an táille seo bunaithe ar an scéim cíos difreálaigh agus mar sin tá sé bunaithe ar d'acmhainní

source: You may qualify if you are:
ga: D'fhéadfá a bheith intofa má/s:

source: • Registered on the local authority housing waiting list
ga: • Tá tú cláraithe ar an liosta feithimh leis an údarás áitiúil

source: • A local authority tenant or a tenant purchaser and you want to buy a private house and return your present house to the local authority
ga: • Tionónta nó tionónta atá ag ceannach thú ón údarás áitiúil agus go bhfuil sé i gceist agat teach príobháideach a cheannach agus do theach a thabhairt ar ais don údarás áitiúil

source: • A tenant for more than one year of a home provided by a housing association under the Rental Subsidy Scheme and you want to buy a private house and return your present house to the local authority
ga: • Tionónta le breis is bliain thú de theach atá curtha ar fáil ag cumann tithíochta faoin scéim Fordheontas Cíosa agus go bhfuil sé i gceist agat teach príobháideach a cheannach agus do theach a thabhairt ar ais don údarás áitiúil

source: The local authority will take into account the urgency of your housing needs and the cost-effectiveness of the proposal when deciding whether to improve your house or your relative's house
ga: Cuirfidh an t-údarás áitiúil an phráinn a bhaineann le do chás san áireamh agus chomh éifeachtach ó thaobh costais a bheadh sé agus iad ag déanamh cinneadh ar do theach nó teach do ghaol a fheabhsú

source: You can sell the house at any time
ga: Is féidir an teach a dhíol ag am ar bith

source: However, if you do so during the 15-year period of charges or before your total payments equal the cost of the works, you will have to make a repayment to the local authority
ga: Ach, má dhéanann tú sin taobh istigh den tréimhse 15 bhliain nó roimh costas na hoibre a bheith íoctha ar ais agat, beidh ort aisíocaíocht a dhéanamh leis an údarás itiúil

source: Contact your local authority to check whether this scheme operates in your area
ga: Déan teagmháil le d'údarás áitiúil chun a fháil amach an oibríonn sé an scéim seo
